## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_argo_istio will be destroyed
  # (because kubernetes_manifest.certificate_argo_istio is not in configuration)
-   resource "kubernetes_manifest" "certificate_argo_istio" {
-       manifest = {
-           apiVersion = "cert-manager.io/v1"
-           kind       = "Certificate"
-           metadata   = {
-               name      = "argocd-cert"
-               namespace = "istio-system"
            }
-           spec       = {
-               commonName = "argocd.wayofthesys.org"
-               dnsNames   = [
-                   "argocd.wayofthesys.org",
                ]
-               issuerRef  = {
-                   kind = "ClusterIssuer"
-                   name = "zerossl"
                }
-               secretName = "wayofthesys-org-tls"
            }
        } -> null
-       object   = {
-           apiVersion = "cert-manager.io/v1"
-           kind       = "Certificate"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "argocd-cert"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               additionalOutputFormats = null
-               commonName              = "argocd.wayofthesys.org"
-               dnsNames                = [
-                   "argocd.wayofthesys.org",
                ]
-               duration                = null
-               emailAddresses          = null
-               encodeUsagesInRequest   = null
-               ipAddresses             = null
-               isCA                    = null
-               issuerRef               = {
-                   group = null
-                   kind  = "ClusterIssuer"
-                   name  = "zerossl"
                }
-               keystores               = {
-                   jks    = {
-                       create            = null
-                       passwordSecretRef = {
-                           key  = null
-                           name = null
                        }
                    }
-                   pkcs12 = {
-                       create            = null
-                       passwordSecretRef = {
-                           key  = null
-                           name = null
                        }
                    }
                }
-               literalSubject          = null
-               privateKey              = {
-                   algorithm      = null
-                   encoding       = null
-                   rotationPolicy = null
-                   size           = null
                }
-               renewBefore             = null
-               revisionHistoryLimit    = null
-               secretName              = "wayofthesys-org-tls"
-               secretTemplate          = {
-                   annotations = null
-                   labels      = null
                }
-               subject                 = {
-                   countries           = null
-                   localities          = null
-                   organizationalUnits = null
-                   organizations       = null
-                   postalCodes         = null
-                   provinces           = null
-                   serialNumber        = null
-                   streetAddresses     = null
                }
-               uris                    = null
-               usages                  = null
            }
        } -> null
    }

  # kubernetes_secret.wayofthesys-tls will be created
+   resource "kubernetes_secret" "wayofthesys-tls" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "tls"

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-org-tls"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
